Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Therefore, as a backup, consider setting up a source code control system with a separate folder for open source and a notification alert any time there is a check-in to this folder.
ja: それゆえに、バックアップとして、オープン ソース用の分離したフォルダーを持つソース コード管理システムの準備と、このフォルダーにチェックインがされた時の警告を検討して下さい。

source: Therefore, companies must fulfill documentation obligations by including copyright, attribution, and license notices text in the documentation of every product they ship and service they provide.
ja: 従って、企業は、出荷する全ての製品や提供する全てのサービスの文書に、著作権、帰属、そしてライセンス通知を記載することで、文書化の義務を満たさなければなりません。

source: Therefore, companies should have a process in place to deal with incoming inquiries, acknowledge their receipt, inform the inquirer that they will be looking into it, and provide a realistic date for follow-up.
ja: 従って企業は照会を受けとり、受領したことを応答し、照会者に検討することを伝え、現実的なフォローアップの日程を通知する方法を定めるべきです。

source: Therefore, companies should not ignore compliance inquiries .
ja: 従って、企業は、コンプライアンスに関する照会を無視するべきではありません。

source: Therefore, it is critical to audit and identify all source code included in a product.
ja: 従って、製品に組み込まれている全てのソース コードを監査し、特定することが重要です。

source: Therefore, it is important to also audit company-developed software components, since they may include open source code, which may lead to compliance failures if not discovered before product ship date.
ja: それゆえに、製品出荷日前に発見されなければコンプライアンス違反に陥るようなオープン ソース コードを含んでいるかもしれませんので、自社開発ソフトウェア コンポーネントを監査することは重要です。

source: Therefore, it is necessary to continuously review compliance policies and processes and introduce improvements.
ja: 従って、今ぷらインすポリシーとプロセスを絶えず評価し、改善する必要があります。

source: Therefore, it is really a smart idea to ensure compliance before a product ships or a service launches.
ja: 従って、製品出荷やサービス立ち上げに先立ってコンプライアンスを確実に行うのが賢いやり方です。

source: Therefore, you should expect to build your compliance infrastructure as you go, keeping in mind scalability for future activities and products.
ja: 従って、企業なりのコンプライアンスのインフラストラクチャーを状況の進展に合わせて構築すべきと考えればよく、その際には将来の活動や製品をふまえ拡張性を考えるべきです。

source: Therefore, you will need to administer the distribution of the code for at least three years from the date you have last shipped your product.
ja: それゆえ、製品を最後に出荷した日から少なくとも3年間は、コード頒布を管理しなければなりません。

source: These guidelines aim to maintain a positive and collaborative attitude with requesters while investigating allegations and ensuring proper actions when violations actually occur.
ja: これらのガイドラインは、申し立てを調査している間に申立人に対して肯定的で協力的な態度を維持することと、ライセンス違反が実際に起きた時には適切な行動を取ることを、確実にします。

source: These packages will be used in a later stage (prior to distribution) to verify and track any changes introduced to the source code by computing the difference between the original package and the modified package.
ja: これらのパッケージは、後の段階で（頒布の前に）、オリジナル パッケージと変更されたパッケージの差異を計算することによって、ソース コードに加えられた全ての変更を検証し追跡するために、使用されます。

source: These problems most commonly involve mixing source code that is licensed under incompatible or conflicting licenses (e.g., proprietary, third-party, and/or open source).
ja: もっともありがちなのは、異なる、または両立しないライセンス（例：プロプラエタリ、サードパーティやオープンソース）下のソースコードを混ぜてしまう、ことです。

source: These rules ensure that any software (proprietary, third-party, open source) that makes its way into the product base has been audited, reviewed, and approved.
ja: これらの規則は、いずれのソフトウェア（プロプライエタリ、サード パーティ、オープン ソース）も製品基盤へ導入されるまでに監査され、レビューされ、承認されることを確実にします。

source: These scenarios are not mutually exclusive and are not the only possible scenarios; however, they are used for illustration and discussion purposes.
ja: これらのシナリオは、相互に排他的ではありませんし、唯一の可能なプロセスでもありません。これらは、図示と議論の目的のために提示します。

source: These sessions can also include discussions of the company’s compliance program, policies, and processes.
ja: これらのセッションは、企業のコンプライアンス プログラム、ポリシー、そしてプロセスに関する議論も含みます。

source: They also need a framework to pool resources (financial, technical, etc.).
ja: リソース プール（財政、技術）のフレームワークを必要としています。

source: They provide easy-to-understand information about these licenses, such as license grants, restrictions, obligations, patent impact, and more.
ja: ライセンスの許諾、制約、義務、特許への影響、その他、このライセンスに関する簡単に理解できる情報が書かれています。

source: They then evaluate risk factors based on feedback provided by both engineering and the open source compliance officer.
ja: 次にリスク要因を、エンジニアとオープンソース コンプライアンス オフィサーからの情報に基づいて評価します。

source: Third-party commercial code, developed by third-party software providers and received by the company building the product/service under a commercial license
ja: サードパーティの商用コード、サードパーティのソフトウェア プロバイダにより開発され、製品やサービスを作る企業が商用ライセンスの下で受領したもの

source: Third-party commercial code, developed by third-party software providers and received by the company building the product/service under a commercial license .
ja: サードパーティの商用コード、サードパーティのソフトウェアプロバイダにより開発され、製品やサービスを作る企業が商用ライセンスの下で受領したもの

source: Third-party components under a commercial license
ja: 商用ライセンスで許諾されたサード パーティ コンポーネント

source: Third-party components under a commercial license .
ja: 商用ライセンスで許諾されたサード パーティ コンポーネント

source: Third-party software developed by independent providers or consultants and made available under a commercial or open source license.
ja: 独立プロバイダやコンサルタントによって開発され、商用ライセンスやオープン ソース ライセンスで許諾されたサード パーティ ソフトウェア。

source: Third-party software provider due diligence: This involves requiring a full disclosure of open source components in products provided by third-party suppliers, with an accompanying review of the disclosure by the open source compliance team.
ja: サード パーティ ソフトウェア プロバイダー精査：これは、オープン ソース コンプライアンス チームによる開示内容のレビューを伴う、サード パーティ供給者によって提供された製品中にあるオープン ソース コンポーネントの全開示を要求します。

source: This advertising clause from the original BSD license is written as follows:
ja: オリジナルのBSDライセンスに由来する広告文は、以下のように書かれています。

source: This case is different from contributing source code (in the form of bug fixes or new feature implementation) to an existing open source project.
ja: このケースは、既存のオープン ソース プロジェクトへ、（不具合修正や新規機能追加の形で）ソース コードの貢献をすることとは異なります。

source: This chapter discusses usage policy and process in addition to the base and incremental compliance process, and guidelines for achieving incremental compliance.
ja: この章では、基本コンプライアンス プロセスとインクリメンタル コンプライアンス プロセスや、インクリメンタル コンプライアンスを達成するためのガイドラインに加えて、利用ポリシーや利用プロセスも議論します。

source: This chapter focuses on the core elements of a compliance process.
ja: この章では、コンプライアンス プロセスの中心的要素に焦点を当てます。

source: This chapter highlights compliance best practices and various considerations outside of the actual compliance process.
ja: この章は、実際のコンプライアンス プロセスの範囲外ではありますが、コンプライアンスのベスト プラクティスや様々な考察に光を当てます。

source: This chapter highlights some of the recommended practices and various considerations when integrating open source in commercial products.
ja: この章では、オープン ソースを商用製品に統合する際の、推奨プラクティスや様々な考察を扱います。

source: This chapter presents guidelines for handling compliance inquires.
ja: この章は、コンプライアンスに関する照会を扱うガイドラインについて示します。

source: This chapter provides a high-level overview of the various elements in an open source management program, surveys the challenges in establishing a new compliance program, and provides advice on how to overcome those challenges.
ja: 本章はオープンソース管理プログラムの様々な構成要素を概観し、新しいコンプライアンス プログラム策定における難しさを概説し、そうした難しさを克服する方法を述べます。

source: This compliance method often gives the organization additional buffer time to finish packaging the source code after the product has shipped.
ja: このコンプライアンス方法は、製品出荷後に、ソース コード パッケージ化終了のための追加の予備時間を組織に与えてくれます。

source: This distribution method is a variation of the online supply method in which you rely on the written offer (in the case of the GPL/LGPL family of licenses) to communicate to your clients how they can request or access the source code.
ja: この頒布方法は、オンライン供給方法の変形で、書面による通知(GPL/LGPL系のライセンスの場合)を利用して、どのようにすればソース コードを要求したりアクセスしたりできるかを顧客に伝えます。

source: This figure does not demonstrate the iterative nature of such a process; a more elaborate view is provided in Figure 17 (page 89).
ja: この図は、プロセスの反復的な性質は示していません。より詳しい図は、図17（90ページ）に示します。.

source: This form of legal support is related to ensuring that appropriate open source notices (copyright, attributions, and license notices) are provided to consumers in relation to any open source included in the product.
ja: こうした法務上のサポートは、製品に含まれるすべてのオープンソースについて、適切なオープンソースの告知 (著作権、帰属、ライセンス告知)を確実に消費者に提供するために行います。

source: This handbook summarizes my experience driving open source compliance activities in the enterprise, and focuses on practical aspects of creating and maintaining an open source compliance program.
ja: このハンドブックは、まさにそういった企業でオープンソース コンプライアンスを推進してきた私の経験をまとめたものであり、オープンソース コンプライアンスプログラムの整備、その運営についての実践的側面にフォーカスしたものとなっています。

source: This helps ensure you are controlling the intake of open source by your product.
ja: これは、製品へ入るオープン ソースの管理を確実にします。

source: This information will provide appropriate attributions in your product documentation.
ja: この情報は、製品ドキュメントに適切に入れられます。

source: This initial auditing process is often described as establishing a clean compliance baseline for your product or software portfolio.
ja: この初期の監査プロセスは、製品やソフトウェア ポートフォリオのクリーンなソフトウェア起点の確立、と呼ばれることが多いです。

source: This involvement includes establishing and maintaining consistent compliance policies and procedures as well as ensuring that the licenses of all the software components in use (proprietary, third-party, and open source) can co-exist before shipment or deployment.
ja: この関わりには首尾一貫したコンプライアンス ポリシーや手続きの確立と維持管理、利用中（プロプラエタリ、サードパーティ、オープンソース）の全ソフトウェアコンポーネントのライセンスが共存し得ることを製品出荷やサービス立ち上げ前に確認すること、が含まれます。

source: This is a simple online form that an engineer or a developer fills out, providing basic information about the source code in question.
ja: これは、技術者や開発者が、問題となるソース コードについての基本情報を提供するために記入する簡単なオンラインのフォームです。

source: This is a very high expectation to meet every single time.
ja: これは、毎回満足させるべきとても高い期待となります。

source: This is a viable option if the product has a user interface that allows the user to interact with it and pull up or display licensing information.
ja: これは、ユーザーと対話してライセンス情報を引き出すか、ライセンス情報を表示するかできるユーザー インタフェースを製品が持っている場合には、実行可能な選択肢です。

source: This is accomplished by examining an architectural diagram that identifies:
ja: これは特定されたアーキテクチャー図を検査することで実行されます。

source: This is an intensive activity over a period of time that can extend for months, depending on how soon you started the compliance activities in parallel to the development activities.
ja: これは数か月かかることもある重い活動で、開発と並行してどの程度早期に作業を開始するかに掛かっています。

source: This is especially the case when the company is about to release previously proprietary source code under open source license(s).
ja: これは特に、企業が元々はプロプラエタリだったソースコードをオープンソース ライセンス下で提供するときに問題となります。

source: This is informally considered a one-way distribution, versus a two-way that involves full community interaction.
ja: コミュニティとの相互関係が双方向であるのに対して、このことは一方向頒布と略式に考えられます。

source: This is not required if the source code was created with the assumption that it will be open sourced.
ja: これはそのソースコードはオープンソースにする前提で開発されたならば不要です。

source: This is not strictly a compliance issue; however, in some cases, an innocent comment about where the code was received can trigger a larger compliance question.
ja: これは厳密にはコンプライアンスの課題ではないですが、しかしながら、ある場合には、コードが受け取られた場所に関する無邪気なコメントが大きなコンプライアンスに関する問い合わせを生むきっかけになる可能性があります。

source: This is usually the preferred method of distribution for developers (and compliance enforcers), as it gives them direct access to the source code without having to pass the eligibility requirement (i.e., they don’t need to buy the product to be eligible to receive the source code).
ja: 開発者は、入手資格を確認されることなく（つまりソース コードの入手資格を得るために製品を購入する必要なく）、直接ソースコードにアクセスが許されますので、このやり方は通常開発者にとって頒布の好ましい方法となります。

source: This is verified by using the linkage dependency-mapping tool.
ja: これは、リンク依存関係マッピング ツールを使って検証されます。

source: This method is best managed via a secure website that requires a certain authentication on the part of the client to access and download the source code packages.
ja: この方法は、アクセスしてソース コード パッケージをダウンロードするための認証を必要とするセキュアなウェブサイトにより最もよく管理されます。

source: This page intentionally left blank.
ja: このページは意図的に空白にしてあります。

source: This policy does not have to be lengthy or complicated.
ja: このポリシーは、長文や複雑なものである必要はありません。

source: This practical advice usually revolves around:
ja: この実際的なアドバイスは、通常以下の点を中心に展開します。

source: This process is best managed via an automated online system, commonly a bug tracker that has a specifically designed workflow to accommodate the management of open source compliance.
ja: これは自動化されたオンラインシステム、通常はオープンソース コンプライアンスの管理を特に組み込んだワークフローに従うバグ追跡システムで行うのがベストです。

source: This process will be discussed in detail in a later chapter.
ja: このプロセスの詳細は後ろの章で述べます。

source: This representation varies from a Legal counsel to a Legal paralegal depending on the task at hand.
ja: 代表者はその時の作業に応じ、法律顧問から弁護士補助職員まで変化します

source: This responsibility is not compliance-related; however, it is listed here for completion of the list of responsibilities.
ja: これはコンプライアンスではないが、責任ある事柄のリストの完全性という観点で挙げておく。

source: This responsibility spans the servers hosting the various tools, the tools, mailing lists, and web portals.
ja: これは各種のツールやメーリングリスト、ウェブのポータルの提供が含まれます。

source: This section introduces a method for responding to compliance inquiries.
ja: この節では、コンプライアンスに関する照会への対応方法について紹介します。

source: This section provides guidelines of how to fulfill open source attribution obligations.
ja: この節では、オープン ソースの帰属に関する義務をどのように達成するかについてのガイドラインを示します。

source: This section, including Figure 4, will provide an overview of these essential elements.
ja: 本節と図4にこれら構成要素の概観を示すします。

source: This software category may include snippets or dependencies as above.
ja: このソフトウェア カテゴリは上と同様にコード断片や依存関係を含んでいるかもしれません。

source: This tool is very helpful in guiding incremental compliance efforts.
ja: 本ツールはコンプライアンス準拠作業を積み上げで行う場合に非常に有用です。

source: This tool will allow you to discover linkages between source code packages that do not conform to company policy.
ja: 本ツールを使うことで、企業のポリシーを満たさないソースコード パッケージとのリンクを発見できます。

source: This topic is discussed at length in a later chapter.
ja: この点は後ろの章で文章を割きます。

source: This topic is discussed in a later chapter.
ja: この点は後ろの章で論じます。

source: This usually applies to licenses that have a patent clause.
ja: これは、通常、特許に関する条項を含むライセンスに適用されます。

source: Those disputes reached a settlement agreement that included one or more of these terms:
ja: これらの紛争解決の合意では下記の一つないし一つ以上 の条項が含まれています。

source: Throughout my journey working with open source software, it was difficult to find practical references on open source compliance.
ja: オープンソース ソフトウェアと共に歩んできた私の旅ですが、振り返るとオープンソース コンプライアンスにおける実践的（プラクティカル）な情報を見つけるのに苦労した旅でした。

source: Throughout the software development, errors and limitations in processes can lead to open source compliance failures.
ja: ソフトウェア開発の全工程において、コンプライアンス プログラム上のエラーや不十分さはコンプライアンス上の失敗に繋がることがあります。

source: Throughout this chapter we will examine these various phases, the inputs and outputs of each phase, and how to control software usage via the compliance process.
ja: この章を通じて、これらの様々なフェーズ、各フェーズのインプットとアウトプット、そしてコンプライアンス プロセスによってソフトウエア利用をどのように管理するかを確認していきます。

source: To guard against such scenarios, companies should consider the following:
ja: そうしたシナリオを防ぐため、企業は下記を考慮すべきです。

source: To learn more about The Linux Foundation, please visit us at linuxfoundation.org.
ja: The Linux Foundation およびその他の活動については、http://www.linuxfoundation.org/ を参照してください。

source: To obtain a copy of the source code being made publicly available by FooBar, Inc.
ja: このFooBar製品で使用されているソフトウェアに関連して、FooBar社(“FooBar”) によって一般に開示されているソース コードのコピーを入手するためには、書面で要求をopensourcecompliance@foobar.comに出す必要があります。

source: To obtain a copy of the source code being made publicly available by FooBar, Inc. (“FooBar”) related to software used in this FooBar product (“Product”), you should send your request in writing to opensourcecompliance@foobar.com.
ja: このFooBar製品で使用されているソフトウェアに関連して、FooBar社(“FooBar”) によって一般に開示されているソース コードのコピーを入手するためには、書面で要求をopensourcecompliance@foobar.comに出す必要があります。

source: To obtain a copy of the source code being made publicly available by FooBar, Inc. (“FooBar”) related to software used in this FooBar product (“Product”), you should send your request in writing to:
ja: このFooBar製品で使用されているソフトウェアに関連して、FooBar社(“FooBar”) によって一般に開示されているソース コードのコピーを入手するためには、書面で要求を以下に出すことが必要です。

source: To obtain a copy of the source code being made publicly available by FooBar, Inc. related to software used in this FooBar product, you can visit http://opensource.foobar.com or send your request in writing by email to opensource@foobar.com or by regular postal mail to:
ja: Foobarの本製品の中で使われているソフトウェアに関連する、FooBar社が公開しているソースコードのコピーを得るには、http://opensource.foobar.com にアクセスするか、opensource@foobar.com にメールでリクエストを送るか、またはリクエストを通常の郵便で

source: To that effect, companies need to implement an end-to-end open source management infrastructure that will allow them to:
ja: そのためには企業はオープンソースを管理するインフラを末端まで構築し下記を行う必要があります。

source: To that end, this book is geared to creating a shared understanding on the best ways to create shared value and innovation while adhering to the spirit and legal particulars of open source licensing.
ja: そのためにも、本書は、オープン ソース ライセンスの精神と法的項目を固守しながらも、共有される価値とイノベーションを創造する最善の方法について共有理解を作り出すことに焦点を合わせています。

source: Today, best practices inform us that none of these approaches are beneficial to any party involved.
ja: 今日、ベスト プラクティスは、これらのアプローチがいずれの関係者の利益にもならないことを教えてくれます。

source: Tool will ID source code that doesn’t match what’s provided by OS component, triggering various flags for Audit
ja: ツールでオープンソースのコンポーネント由来ではないソースコードは識別できるので、監査のため各種のフラグをつけます

source: Tool will ID source code that doesn’t match what’s provided by OS component, triggering various flags for Audit Train the staff
ja: ツールでオープンソースのコンポーネント由来ではないソースコードは識別できるので、監査のため各種のフラグをつけます スタッフを訓練

source: Tools
ja: ツール

source: Tools 34
ja: ツール 34

source: Tools are an essential element in a compliance program in that they can help organizations perform compliance activities efficiently and accurately.
ja: ツールは、組織がコンプライアンス活動を効率的で正確に実行するのを助ける、コンプライアンス プログラムの中の不可欠要素です。

source: Track changes: Maintain a change log for each modified open source component: As part of meeting the open source license obligations and depending on the open source license in questions, some licenses (such as the GPL/LGPL family of licenses) mandate that modified files carry prominent notices stating that you changed the files and the date of the change(s).
ja: 変更の追跡：変更ログを変更したオープンソース コンポーネント毎に維持管理： オープンソースのライセンス上の義務を満たすため変更ログが必要となります。問題となるライセンスに依りますが、ある種のライセンス（GPL/LGPLファミリーなど）では変更されたファイルには、変更したこととその日付を目立つように付けることを求めています。

source: Traditionally, platforms and software stacks were implemented using proprietary software, and consisted of various software building blocks that originated as a result of internal development or via third-party software providers with negotiated licensing terms.
ja: 従来、プラットフォームやソフトウェア スタックはプロプラエタリなソフトウェアを使って実装され、内部開発されたソフトや交渉の結果であるライセンス条件によるサードパーティのソフトから成る様々なソフトウェアのブロックから構成されていました。

source: Train the staff
ja: スタッフを訓練

source: Training also serves as a venue to publicize and promote the compliance policy and processes within the organization and to foster a culture of compliance.
ja: またトレーニング は、企業内でコンプライアンス ポリシーを広め推進し実施し、コンプライアンスの文化を育てる場となります。

source: Training is Important
ja: 訓練は重要

source: Training is Important Training is an essential building block in a compliance program, to ensure that employees have a good understanding of the policies governing the use of open source software.
ja: 訓練は重要 訓練はコンプライアンスプログラムにおいて必須の構成要素であり、オープンソースソフトウェアの利用を律するポリシーを従業員がよく理解する礎となります。

source: Training is Important 30
ja: 訓練は重要 30

source: Training is an essential building block in a compliance program, to ensure that employees have a good understanding of the policies governing the use of open source software.
ja: 訓練はコンプライアンス プログラムにおいて必須の構成要素であり、オープンソース ソフトウェアの利用を律するポリシーを従業員がよく理解する礎となります。

source: Training may also cover the business and legal risks of incorporating open source in products.
ja: トレーニングは、製品にオープン ソースを統合することによるビジネスリスク、法的リスクも扱います。

source: Training must be mandatory for all staff engaged in management and development of software using open source.
ja: この訓練はオープンソースを使ったソフトウェアの開発や管理に関わる従業員全員が受けなければなりません。

source: Translate basic information in target languages about open source information related to the product or software stack
ja: 製品やソフトウェア スタックに関わるオープンソースについて、基本的情報をターゲットとなる言語に翻訳

source: Treat all inquiries as formal inquiries, and work under the assumption that any information you disclose as part of the interactions with the inquirer can become public.
ja: 全ての照会は、正式な照会として扱います。照会者とのやりとりの中で開示する情報は、一般に開示する可能性があるという前提で作業をします。

source: Trigger the distribution process before the product ships.
ja: 製品出荷前に、頒布プロセスを開始させます。

source: Two types of communication activities are important to consider: internal with your organization, and external towards the developer communities of the open source projects used in your products.
ja: 2種類の対話、あなたの組織内での内部的なもの、あなたの製品で使われているオープンソースのプロジェクトの開発者コミュニティとの外部に向けたもの、を考えることが重要です。

source: Typically, the Legal Counsel reviews the compliance ticket in the online tracking system (for instance, JIRA or Bugzilla), the resulting report from the source code scanning tool, and the license
ja: 典型的には、法律顧問はコンプライアンス チケットを評価します。これはオンライン トラッキング システム (例えばJIRAやBugzilla) 、ソースコードをスキャンするツールの結果報告、

source: USAGE CONSIDERATIONS
ja: 利用に関する考察

source: USAGE CONSIDERATIONS 130
ja: 利用に関する考察 130

source: Under the new model, a product could now have any combination of:
ja: この新たなモデルでは、製品は下記の任意の組み合わせとなります。

source: Under this development model, software components can consist of source code originating from any number of different sources and be licensed under different licenses; for instance, software component A can include proprietary source code in addition to third-party proprietary source code, while software component B can include proprietary source code in addition to source code from an open source project.
ja: この開発モデルでは、ソフトウェアコンポーネントは任意の数の出所から来た、様々なライセンス下でライセンスされたソースコードから構成され得ます。たとえば、ソフトウェアコンポーネントAはサードパーティのプロプラエタリのコードに加えプロプラエタリなコードも含んでおり、ソフトウェアコンポーネントBはオープンソースプロジェクトからのソースコードに加えプロプラエタリなコードを含む、などです。

source: Undergo open source training: All engineers must take the available open source training.
ja: オープンソースの訓練を受ける：すべてのエンジニアは利用できるオープンソースの訓練を受けねばなりません。

source: Understand the Risks During Mergers and Acquisitions (M&A)
ja: M&Aによるリスクの理解

source: Understand the open source code in use and its implications as part of the due diligence performed prior to any corporate transaction.
ja: 利用されているオープン ソース コードと関連する事項は、企業間の取引に先立って実施される資産監査対象の一部であることを理解します。

source: Update the product manual to:
ja: 製品マニュアルを更新します。

source: Update the product manual to: .
ja: 製品マニュアルを更新します。：

source: Update the release bill of materials to account for any open source added (or removed) since the last previous scan
ja: 最後のスキャンからの間に、加えられた（削除された）オープン ソースを説明するリリースBOMを更新します。

source: Update the release bill of materials to account for any open source added (or removed) since the last previous scan .
ja: 最後のスキャンからの間に、加えられた（削除された）オープン ソースを説明するリリースBOMを更新します。

source: Update the software inventory to reflect that the specific OSS software component version x is approved for usage in product y, version z.
ja: あるOSSソフトウェア コンポーネントのバージョンXは、製品YのバージョンZでの使用が承認されたことをソフトウェア一覧表に反映させます。

source: Update the software registry by removing the software components that are not used anymore.
ja: もはや使われなくなったソフトウェア コンポーネントをソフトウエア管理表から除いて更新します。

source: Update to an out-of-date attribution or copyright notice
ja: 無効となった帰属や著作権の通知に対する更新

source: Update to an out-of-date attribution or copyright notice .
ja: 無効となった帰属や著作権の通知に対する更新

source: Updating product documentation to reflect open source usage
ja: オープン ソース利用を反映した製品文書の更新

source: Updating product documentation to reflect open source usage 8.
ja: オープン ソース利用を反映した製品文書の更新 8.

source: Upgrading to Newer Versions of open source
ja: オープン ソースの新しいバージョンへの更新
